Universal_FoodShop-master/app/views/orders/index.html.erb

          <tr>
            <td><%= order.order_date %></td>
---
SELECT "orders".* FROM "orders"