Universal_FoodShop-master/app/views/orders/show.html.erb

SELECT "orderitems".* FROM "orderitems" WHERE "orderitems"."order_id" = ?  [["order_id", 1]]
---
      <tr>
        <% item = Orderitem.find_by_id(id) %>