Universal_FoodShop-master/app/controllers/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
SELECT "categories".* FROM "categories"
SELECT "proveniences".* FROM "proveniences"
---
  def index
    @items = Item.all.paginate(page: params[:page], per_page: 4)

    @categories = Category.all

    @proveniences = Provenience.all

INSERT INTO "items" ("title", "description", "price", "image_url", "category", "provenience", "inStock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE (category like '%test%')
---
  def search
     st = "%#{params[:q]}%"
     @items = Item.where("category like ?", st)