Universal_FoodShop-master/app/controllers/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index

    @user = User.find(current_user.id)
    @orders = @user.orders.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "orderitems".* FROM "orderitems" WHERE "orderitems"."order_id" = ?  [["order_id", 1]]
---
  def show
    @user = User.find(current_user.id)
    @orderitems = Orderitem.where(order_id: params[:id])