Universal_FoodShop-master/app/controllers/static_pages_controller.rb

SELECT "items".* FROM "items"
SELECT "categories".* FROM "categories"
SELECT "proveniences".* FROM "proveniences"
---
  def home
    @items = Item.all

    @categories = Category.all

    @proveniences = Provenience.all

SELECT "items".* FROM "items" WHERE (category like 'Rice and Flour' )
---
  def category
    catName = params[:title]
    @items = Item.where("category like ? ", catName)

SELECT "items".* FROM "items" WHERE (provenience like 'Indian' )
---
  def provenience
    provName = params[:title]
    @items = Item.where("provenience like ? ", provName)

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Paid by User: bob@the.user"], ["updated_at", "2020-07-31 14:31:27.643755"], ["id", 1]]
---
  def paid
    # redirect_to "/cart/clear"
    flash[:notice] = 'Transaction Complete'
    @order = Order.last
    @order.update_attribute(:status , "Paid by User: #{current_user.email}")

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def paid
    # redirect_to "/cart/clear"


    @order = Order.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "f"], ["updated_at", "2020-08-03 15:35:02.173947"], ["id", 2]]
---
  def downgrade
  @user = User.find_by(id: params[:id])
  @user.update_attribute(:admin, false)

SELECT "users".* FROM "users"
---
  def allusers
    @users = User.all