Universal_FoodShop-master/app/views/cart/createOrder.html.erb

      <tr>
        <% item = Orderitem.find_by_id(id) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 1 LIMIT ?  [["LIMIT", 1]]