Universal_FoodShop-master/app/views/cart/index.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <tr>
                <td ><% item = Item.find_by_id(id) %></td >